// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/*
void palindrom (int a){
    string num = a.ToString();
    int n = num.Length;
 if (num[0]== num[4] && num [1] == num [3]) {
    Console.WriteLine("Введенное число палиндром");
    }
    
    else {
        Console.WriteLine("Введенное число не палиндром");
    }
}
Console.WriteLine("Введите пятизначное число :");
int x = Convert.ToInt32(Console.ReadLine());
if (x <9999 || x >99999) {
    Console.WriteLine ("Вы ввели не коректное число");
}
else palindrom(x);
*/